2+2

Hello

<b>Hello</b>

In [2]:
a= 2+2

In [3]:
((67+33) * (25-20)) / 25

20.0

In [4]:
(4 + 5 * 60 -17 + 65/4) ** (1/2)

17.414074767267998

In [5]:
6.996 + 45*(13/2) ** 2 + 2*(18) ** (1/2)

1916.7312813742387

In [9]:
(1267 - 20 * (125 / 2) ** 2) / ((8 ** 5) * 6)

-0.3909200032552083

In [12]:
((((9 ** (1/2)) ** 3) ** 2) ** 2) / ((-2) ** (-3))

-4251528.0

In [67]:
import os
import pandas as pd

files = os.listdir('data')

data = pd.DataFrame(columns = ['userId', 'movieId', 'rating', 'timestamp'])
for filename in files:
    temp = pd.read_csv( os.path.join('data', filename), names = ['userId', 'movieId', 'rating', 'timestamp'] )
    data = pd.concat([data, temp])
    
    
#data.info()

ratings = pd.read_csv('ratings.csv')
movies = pd.read_csv('movies.csv')

joined = ratings.merge(movies, on='movieId', how='outer')

joined[joined.movieId == 3456]

,userId,movieId,rating,timestamp,title,genres
100839,NaN,3456,NaN,NaN,"Color of Paradise, The (Rang-e khoda) (1999)",Drama

In [45]:
import pandas as pd

items_dict = {

    'item_id': [417283, 849734, 132223, 573943, 19475, 3294095, 382043, 302948, 100132, 312394], 

    'vendor': ['Samsung', 'LG', 'Apple', 'Apple', 'LG', 'Apple', 'Samsung', 'Samsung', 'LG', 'ZTE'],

    'stock_count': [54, 33, 122, 18, 102, 43, 77, 143, 60, 19]

}

purchase_log = {

    'purchase_id': [101, 101, 101, 112, 121, 145, 145, 145, 145, 221],

    'item_id': [417283, 849734, 132223, 573943, 19475, 3294095, 382043, 302948, 103845, 100132], 

    'price': [13900, 5330, 38200, 49990, 9890, 33000, 67500, 34500, 89900, 11400]

}


items_df = pd.DataFrame(items_dict)
purchase_df = pd.DataFrame(purchase_log)

joined = items_df.merge(purchase_df, on='item_id', how='left')

joined["purchase_id"] = joined["price"] * joined["stock_count"]

joined['purchase_id'].sum()

19729490.0

In [183]:

    
def process_user_id(s):
    new_s = s.replace('Запись пользователя № - ', '')
    new_s = new_s.replace('user_', '')
    return new_s

def process_time(s):
    if (str(s).find('[') != -1):
        return str(s).replace('[', '')
    else:
        return s
    
log = pd.read_csv("log.csv",header=None) 
log.columns = ['user_id','time','bet','win']
log.time = log.time.apply(process_time)
log.user_id = log.user_id.apply(process_user_id)
log = log[log.user_id.str.contains('error') == False]
log

    user_id                 time      bet     win
0       919  2019-01-01 14:06:51      NaN     NaN
1       973  2019-01-01 14:51:16      NaN     NaN
2       903  2019-01-01 16:31:16      NaN     NaN
3       954  2019-01-01 17:17:51      NaN     NaN
4       954  2019-01-01 21:31:18      NaN     NaN
..      ...                  ...      ...     ...
991     965  2019-04-20 12:55:41    800.0  6927.0
992     967  2019-04-20 14:59:36  10154.0     NaN
993     973  2019-04-20 17:09:56  10254.0     NaN
994     977  2019-04-20 18:10:07  10354.0     NaN
995     984   2019-04-20 9:59:58   9754.0     NaN

[985 rows x 4 columns]